import calendar
import datetime

"""
Овен (21.03 – 20.04)
Телець (21.04 – 21.05)
Близнята (22.05 – 21.06)
Рак (22.06 – 22.07)
Лев (23.07 – 21.08)
Діва (22.08 – 23.09)
Терези (24.09 – 23.10)
Скорпіон (24.10 – 22.11)
Стрілець (23.11 – 21.12)
Козеріг (22.12 – 20.01)
Водолій (21.01 – 18.02)
Риби (19.02 – 20.03)
"""

day = 31
month = 1

day = int(input('Введіть день вашого народження: '))
month = int(input('Введіть місяць вашого народження: '))
max_day = calendar.monthrange(2023, month)[1]

if not (1 <= day <= max_day and 1 <= month <= 12):
    print('Помилка, день або місяць неправильний!')
    exit()

user_date = datetime.date(2023, month, day)
if datetime.date(2023, 1, 21) <= user_date <= datetime.date(2023, 2, 18):
    print('Ви Водолій')
    print('Пом’якшити гостроту щоденних викликів можуть допомогти прості та зрозумілі речі, як-от хобі. Одне з них — '
          'випікання, традиційне для українців ремесло, яке не тільки демонструє глибокий зв’язок між минулим і '
          'сьогоденням, а й сприяє віднайденню душевного спокою та фокусуванню на важливому тут і зараз.')
elif datetime.date(2023, 2, 19) <= user_date <= datetime.date(2023, 3, 20):
    print('Ви Риби')
    print('Представникам знаків Води — Рака, Скорпіона, Риб — рік нагадуватиме контрастний душ: то підноситиме догори '
          'і спонукатиме до відкритості та творчості, то занурюватиме на звичні глибини, даруючи опору та спокій. '
          'Цього року ви — завбачливі ентузіасти. Ваші уява та інтуїція будуть на висоті. Якщо у вас є заповітна мрія '
          'або ціль, саме ці здібності допоможуть швидше наблизитися до неї.')
elif datetime.date(2023, 1, 1) <= user_date <= datetime.date(2023, 1, 20) or datetime.date(2023, 12, 22) <= user_date <= datetime.date(2023, 12, 31):
    print('Ви Козеріг')
    print("Дайте шанс людині, з якою ви деякий час тому розлучилися майже ворогами, виправити ситуацію: цілком "
          "можливо, що вона усвідомила свою помилку і щиро хоче помиритися.")
elif datetime.date(2023, 11, 23) <= user_date <= datetime.date(2023, 12, 21):
    print('Ви Стрілець')
    print("Чим більше задоволення ви сьогодні отримаєте від життя, тим краще, до того ж не тільки для вас, "
          "а й для тих, хто перебуває поруч, тому намагайтеся ні в чому собі не відмовляти – насолоджуйтесь життям "
          "максимально.")
elif datetime.date(2023, 10, 24) <= user_date <= datetime.date(2023, 11, 22):
    print('Ви Скорпіон')
    print("Енергію, володарем якої ви станете сьогодні, потрібно направити на роботу, а не на з'ясування стосунків з "
          "оточенням: вогонь сварки, яка почалася цього дня, дуже важко буде загасити.")
elif datetime.date(2023, 9, 24) <= user_date <= datetime.date(2023, 10, 23):
    print('Ви Терези')
    print("Як би вам не хотілося присвятити день домашнім клопотам, відмовтеся від цієї ідеї, оскільки все падатиме з "
          "рук, і бажаного результату – ідеального ладу – ви однаково не отримаєте.")
elif datetime.date(2023, 8, 22) <= user_date <= datetime.date(2023, 9, 23):
    print('Ви Діва')
    print("Відчувши, що вас долають сумні думки, перейдіть на заняття, яке допоможе відволіктися — найкраще, "
          "якщо воно буде пов'язане з фізичними зусиллями: наприклад, влаштуйте в будинку прибирання.")
elif datetime.date(2023, 7, 23) <= user_date <= datetime.date(2023, 8, 21):
    print('Ви Лев')
    print("Критику, почуту цього дня, не варто сприймати близько до серця: найімовірніше, вона буде продиктована не "
          "об'єктивними, а суб'єктивними міркуваннями того, хто критикує – простіше кажучи, заздрістю.")
elif datetime.date(2023, 6, 22) <= user_date <= datetime.date(2023, 7, 22):
    print('Ви Рак')
    print("Зірки радять вам звертати увагу на знаки, які надсилатимуть вам вищі сили: навіть випадково почута на "
          "вулиці фраза може підказати вам, як чинити у важливій життєвій ситуації.")
elif datetime.date(2023, 5, 22) <= user_date <= datetime.date(2023, 6, 21):
    print('Ви Близнята')
    print("Сьогодні, як і завжди, поганий настрій у жодному разі не можна зривати на людях із оточення – ні "
          "сторонніх, які випадково підвернулися під руку, ні тим паче рідних, беззахисних перед вашою агресією.")
elif datetime.date(2023, 4, 21) <= user_date <= datetime.date(2023, 5, 21):
    print('Ви Телець')
    print("Романтичні побачення та зустрічі з друзями рекомендується перенести на інший день – відсутність "
          "порозуміння може стати причиною як дрібних сварок, так і серйозних суперечок.")
elif datetime.date(2023, 3, 21) <= user_date <= datetime.date(2023, 4, 20):
    print('Ви Овен')
    print("На роботі бажано зосередитися на розпочатих раніше, але поки що незавершених з якоїсь причини справах, "
          "розпочинати реалізацію нових не варто – успіхом вони не увінчаються.")

print('Все ок')
